---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.VendorCode
source: html/85760f82-71ee-4c5d-efc1-84f4555f7c9a.htm
---
# Autodesk.Revit.DB.FabricationPart.VendorCode Property

The vendor code of the fabrication part.

## Syntax (C#)
```csharp
public string VendorCode { get; }
```